In [1]:
import numpy as np
import pandas as pd

In [65]:
df_pup = pd.DataFrame( 
[["0","Finch", "USA"],["1","Grant", "USA"],["2","Neon", "Germany"],["3","James", "USA"],["4","Ash", "France"],
["5","Buddy", "Australia"],["6","Violet", "Germany"],["7","Niko", "Italy"],
["8","Ingo", "Japan"],["9","Volo", "Japan"]],
columns = ["ID","Name", "Country"])
df_pup

  ID    Name    Country
0  0   Finch        USA
1  1   Grant        USA
2  2    Neon    Germany
3  3   James        USA
4  4     Ash     France
5  5   Buddy  Australia
6  6  Violet    Germany
7  7    Niko      Italy
8  8    Ingo      Japan
9  9    Volo      Japan

In [74]:
df_owner = pd.DataFrame( 
[["0","Josh", "USA"],["1","Mark", "USA"],["2","Zeke", "Germany"],["3","Jessie", "USA"],["4","Brock", "France"],
["5","Skip", "Australia"],
["6","Gilbert", "Germany"],["7","Luca", "Italy"],["8","Emmett", "Japan"],["9","Cynthia", "Japan"]],
columns = ["ID","Owner", "Country"])
df_owner

  ID    Owner    Country
0  0     Josh        USA
1  1     Mark        USA
2  2     Zeke    Germany
3  3   Jessie        USA
4  4    Brock     France
5  5     Skip  Australia
6  6  Gilbert    Germany
7  7     Luca      Italy
8  8   Emmett      Japan
9  9  Cynthia      Japan

In [80]:
df_pup.to_csv('pup.csv')
df_owner.to_csv("owner.csv")

In [68]:
df_pup.count()

ID         10
Name       10
Country    10
dtype: int64

In [69]:
df_pup.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   ID       10 non-null     object
 1   Name     10 non-null     object
 2   Country  10 non-null     object
dtypes: object(3)
memory usage: 368.0+ bytes

In [70]:
print(len(df_pup.columns))

3

In [73]:
df_pup.groupby(["Country"]).size()

Country
Australia    1
France       1
Germany      2
Italy        1
Japan        2
USA          3
dtype: int64

In [75]:
df_owner.count()

ID         10
Owner      10
Country    10
dtype: int64

In [76]:
df_owner.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   ID       10 non-null     object
 1   Owner    10 non-null     object
 2   Country  10 non-null     object
dtypes: object(3)
memory usage: 368.0+ bytes

In [77]:
print(len(df_owner.columns))

3

In [79]:
df_owner.groupby(["Country"]).size()

Country
Australia    1
France       1
Germany      2
Italy        1
Japan        2
USA          3
dtype: int64